In [1]:
import numpy as np
import pandas as pd

In [4]:
df = pd.read_csv('https://raw.githubusercontent.com/ardhiraka/PFDS_sources/master/property_data.csv')

In [5]:
df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3        1  1000
1  100002000.0   197.0   LEXINGTON            N            3      1.5    --
2  100003000.0     NaN   LEXINGTON            N          NaN        1   850
3  100004000.0   201.0    BERKELEY           12            1      NaN   700
4          NaN   203.0    BERKELEY            Y            3        2  1600
5  100006000.0   207.0    BERKELEY            Y          NaN        1   800
6  100007000.0     NaN  WASHINGTON          NaN            2   HURLEY   950
7  100008000.0   213.0     TREMONT            Y           --        1   NaN
8  100009000.0   215.0     TREMONT            Y           na        2  1800

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   PID           8 non-null      float64
 1   ST_NUM        7 non-null      float64
 2   ST_NAME       9 non-null      object
 3   OWN_OCCUPIED  8 non-null      object
 4   NUM_BEDROOMS  7 non-null      object
 5   NUM_BATH      8 non-null      object
 6   SQ_FT         8 non-null      object
dtypes: float64(2), object(5)
memory usage: 632.0+ bytes

Standard Missing Values
- Merupakan values yang hasilnya kosong dan NA, yang masih bisa terdeteksi oleh pandas bahwa empty cells dan 'NA' akan dibaca np.NaN

In [8]:
df['ST_NUM']

0    104.0
1    197.0
2      NaN
3    201.0
4    203.0
5    207.0
6      NaN
7    213.0
8    215.0
Name: ST_NUM, dtype: float64

In [9]:
df['ST_NUM'].isnull()

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7    False
8    False
Name: ST_NUM, dtype: bool

np.NaN beda dengan string kosong '', sehingga dianggap ada datanya. Data yang dianggap kosong adalah data yang hanya ,*kosong, di dalamnya pada saat kondisi baris kiri kanannya ada object.

In [10]:
data = pd.DataFrame({'col1':[1,2,3,4,'--','na','']})
data

  col1
0    1
1    2
2    3
3    4
4   --
5   na
6

Non Standard Missing Values 
- Merupakan pemeriksaan pada data yang sifatnya diluar NA dan empty cells
- Disebut juga NA yang formatnya berbeda yang lebih sulit untuk dianalisa 

In this column, there’s four missing values.

- n/a
- NA
- —
- na

In [13]:
# Coba cek seperti step di standard missing values
df['NUM_BEDROOMS'].isnull()

0    False
1    False
2     True
3    False
4    False
5     True
6    False
7    False
8    False
Name: NUM_BEDROOMS, dtype: bool

Padahal harusnya baris ke 7 dan 8 di atas disebut data kosong, tapi malah tidak oleh pandas

Di atas data seperti -- na dll tidak dianggap null , maka perlu kita kelompokkan data tersebut jadi array sebuah missing values

In [12]:
missing_values = ["n/a","na",'--']

In [ ]:
dmv = pd.read_csv('https://raw.githubusercontent.com/ardhiraka/PFDS_sources/master/property_data.csv',na_values=missing_values)